<template>
  <div>
    <ve-line :data="chartData"></ve-line>
  </div>
</template>

<script>
import VeLine from 'v-charts/lib/line.common'
export default {
  components: { VeLine },
  data () {
    return {
      chartData: {
        columns: ['日期', '销售量'],
        rows: [
          { '日期': '1月1日', '销售量': 123 },
          { '日期': '1月2日', '销售量': 1223 },
          { '日期': '1月3日', '销售量': 2123 },
          { '日期': '1月4日', '销售量': 4123 },
          { '日期': '1月5日', '销售量': 3123 },
          { '日期': '1月6日', '销售量': 7123 },
          { '日期': '1月7日', '销售量': 7123 },
          { '日期': '1月8日', '销售量': 7454 },
          { '日期': '1月9日', '销售量': 5645 },
          { '日期': '1月10日', '销售量': 5645 },
          { '日期': '1月11日', '销售量': 7123 },
          { '日期': '1月12日', '销售量': 7156 },
          { '日期': '1月13日', '销售量': 7173 },
          { '日期': '1月14日', '销售量': 7134 },
          { '日期': '1月15日', '销售量': 7485 }
        ]
      }
    }
  }
}
</script>

<style scope>
</style>
