<template>
  <div>
    <ve-line class="pie"
             :data="chartData"
             :settings='chartSettings'></ve-line>
  </div>
</template>

<script>
import VeLine from 'v-charts/lib/line.common'
export default {
  components: { VeLine },
  data () {
    this.chartSettings = {
      radius: 100,
      offsetY: 140,
      legendLimit: 0
    }
    return {
      chartData: {
        columns: ['日期', '销售量'],
        rows: [
          { '日期': '1月1日', '销售量': 100 },
          { '日期': '1月2日', '销售量': 75 },
          { '日期': '1月3日', '销售量': 25 },
          { '日期': '1月4日', '销售量': 45 },
          { '日期': '1月5日', '销售量': 50 },
          { '日期': '1月6日', '销售量': 46 },
          { '日期': '1月7日', '销售量': 22 },
          { '日期': '1月8日', '销售量': 88 },
          { '日期': '1月9日', '销售量': 22 },
          { '日期': '1月10日', '销售量': 66 },
          { '日期': '1月11日', '销售量': 87 },
          { '日期': '1月12日', '销售量': 100 }
          // { '日期': '1月13日', '销售量': 100 },
          // { '日期': '1月14日', '销售量': 100 },
          // { '日期': '1月15日', '销售量': 100 },
          // { '日期': '1月16日', '销售量': 100 },
          // { '日期': '1月17日', '销售量': 100 },
          // { '日期': '1月18日', '销售量': 100 },
          // { '日期': '1月19日', '销售量': 100 },
          // { '日期': '1月20日', '销售量': 100 },
          // { '日期': '1月21日', '销售量': 100 },
          // { '日期': '1月22日', '销售量': 100 },
          // { '日期': '1月23日', '销售量': 100 },
          // { '日期': '1月24日', '销售量': 100 },
          // { '日期': '1月25日', '销售量': 100 },
          // { '日期': '1月26日', '销售量': 100 },
          // { '日期': '1月27日', '销售量': 100 },
          // { '日期': '1月28日', '销售量': 100 },
          // { '日期': '1月29日', '销售量': 100 },
          // { '日期': '1月30日', '销售量': 100 },
          // { '日期': '1月31日', '销售量': 100 }

        ]
      }
    }
  }
}
</script>

<style scope>
</style>
